Table of Contents
 Interface IIdeaRegion3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents a region in three-dimensional space included outline (border) and openings.
public interface IIdeaRegion3D : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 LocalCoordinateSystem
Local Coordinate System (LCS) of the region 3D.
CoordSystem LocalCoordinateSystem { get; }
Property Value
CoordSystem
 Openings
Gets the hole polygons inside the region
List<IIdeaPolyLine3D> Openings { get; }
Property Value
List<IIdeaPolyLine3D>
 Outline
Gets the outline polyline of the region
IIdeaPolyLine3D Outline { get; }
Property Value
IIdeaPolyLine3D
 Edit this page